Revit 2027 API
DimensionSegmentArray.Item Property
Gets or sets an item at a specified index within the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual DimensionSegment this[
	int index
] { get; set; }
Public Overridable Property Item (
	index As Integer
) As DimensionSegment
	Get
	Set
public:
virtual property DimensionSegment^ Item[int index] {
	DimensionSegment^ get (int index);
	void set (int index, DimensionSegment^ value);
}
abstract Item : DimensionSegment with get, set
override Item : DimensionSegment with get, set
Parameters
index Int32
The index of the item to be set or retrieved.
Return Value
DimensionSegment
Returns the object at the specified index.
See Also
Reference
DimensionSegmentArray Class
Autodesk.Revit.DB Namespace